; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v2)
             (pred_4 ?v7 ?v12)
             (pred_8 ?v9 ?v12)
             (pred_2 ?v11 ?v9 )
	     (pred_5 ?v9)
             (pred_3 ?v6)
             (pred_6 ?v7)
             (pred_7 ?v12)
             (pred_12 ?v9)
             (pred_9 ?v7)
             (pred_10 ?v9)
             (pred_1 ))



(:action op_2
:parameters (?v10 ?v8 ?v1 ?v4)
:precondition (and (pred_3 ?v10) (pred_3 ?v8) (pred_6 ?v1) (pred_7 ?v4)
          (pred_11 ?v10 ?v8) (pred_4 ?v1 ?v4)
                   (pred_8 ?v8 ?v4) (pred_5 ?v10) 
                   (pred_12 ?v8) (pred_9 ?v1))
:effect (and  (pred_10 ?v8) (not (pred_12 ?v8))))


(:action op_5
:parameters (?v10 ?v3)
:precondition (and (pred_3 ?v10) (pred_3 ?v3)
               (pred_5 ?v10) (pred_11 ?v10 ?v3) (pred_10 ?v3))
:effect (and (pred_5 ?v3) (not (pred_5 ?v10))))

(:action op_3
:parameters (?v10 ?v1)
:precondition (and (pred_3 ?v10) (pred_6 ?v1) 
                  (pred_5 ?v10) (pred_2 ?v1 ?v10) (pred_1 ))
:effect (and (pred_9 ?v1)
   (not (pred_2 ?v1 ?v10)) (not (pred_1 ))))


(:action op_1
:parameters (?v10 ?v5 ?v13)
:precondition (and (pred_3 ?v10) (pred_6 ?v5) (pred_6 ?v13)
                  (pred_5 ?v10) (pred_9 ?v13) (pred_2 ?v5 ?v10))
:effect (and (pred_9 ?v5) (pred_2 ?v13 ?v10)
        (not (pred_9 ?v13)) (not (pred_2 ?v5 ?v10))))

(:action op_4
:parameters (?v10 ?v1)
:precondition (and (pred_3 ?v10) (pred_6 ?v1) 
                  (pred_5 ?v10) (pred_9 ?v1))
:effect (and (pred_1 ) (pred_2 ?v1 ?v10) (not (pred_9 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_16 obj_10 obj_03 obj_18 obj_08 obj_21 obj_05 obj_07 obj_19 obj_14 obj_09 obj_11 obj_22 obj_02 obj_06
    obj_12 obj_17 obj_01
    obj_04 obj_15 obj_20
    )

    (:init
       (pred_1)

       (pred_3 obj_13)
       (pred_3 obj_16)
       (pred_3 obj_10)
       (pred_3 obj_03)
       (pred_3 obj_18)
       (pred_3 obj_08)
       (pred_3 obj_21)
       (pred_3 obj_05)
       (pred_3 obj_07)
       (pred_3 obj_19)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_11)
       (pred_3 obj_22)
       (pred_3 obj_02)
       (pred_3 obj_06)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_7 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_15)
       (pred_6 obj_20)

       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_16 obj_08)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_03 obj_05)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_08 obj_19)
       (pred_11 obj_08 obj_21)
       (pred_11 obj_08 obj_16)
       (pred_11 obj_08 obj_18)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_21 obj_08)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_05 obj_03)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_19)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_14)
       (pred_11 obj_19 obj_08)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_14 obj_02)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_14 obj_19)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_11 obj_22)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_22 obj_02)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_11)
       (pred_11 obj_02 obj_06)
       (pred_11 obj_02 obj_14)
       (pred_11 obj_02 obj_22)
       (pred_11 obj_06 obj_09)
       (pred_11 obj_06 obj_02)
       (pred_12 obj_14)
       (pred_12 obj_06)
       (pred_12 obj_13)
       (pred_8  obj_14 obj_12)
       (pred_8  obj_06 obj_17)
       (pred_8  obj_13 obj_01)
       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_18)
       (pred_10 obj_08)
       (pred_10 obj_21)
       (pred_10 obj_05)
       (pred_10 obj_07)
       (pred_10 obj_19)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_10 obj_22)
       (pred_10 obj_02)

       (pred_4  obj_04 obj_12)
       (pred_4  obj_15 obj_17)
       (pred_4  obj_20 obj_01)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_20 obj_18)
       (pred_5 obj_02)
    )

    (:goal (and
       (pred_2 obj_15 obj_18)
       (pred_2 obj_20 obj_09)
    ))
(:constraints
  (always (not (pred_5 obj_21)))
)
)

; plan
1. (op_5 obj_02 obj_22)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_22)
   goals met: 0 of 2
2. (op_5 obj_22 obj_19)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_19)
   goals met: 0 of 2
3. (op_5 obj_19 obj_08)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_08)
   goals met: 0 of 2
4. (op_5 obj_08 obj_18)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_18)
   goals met: 0 of 2
5. (op_3 obj_18 obj_20)
   deleted: (pred_2 obj_20 obj_18) (pred_1)
   added: (pred_9 obj_20)
   goals met: 0 of 2
6. (op_5 obj_18 obj_08)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_08)
   goals met: 0 of 2
7. (op_5 obj_08 obj_16)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_16)
   goals met: 0 of 2
8. (op_5 obj_16 obj_10)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_10)
   goals met: 0 of 2
9. (op_5 obj_10 obj_03)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_03)
   goals met: 0 of 2
10. (op_5 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_05)
   goals met: 0 of 2
11. (op_5 obj_05 obj_09)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_09)
   goals met: 0 of 2
12. (op_4 obj_09 obj_20)
   deleted: (pred_9 obj_20)
   added: (pred_1) (pred_2 obj_20 obj_09)
   goals met: 1 of 2
13. (op_5 obj_09 obj_05)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_05)
   goals met: 1 of 2
14. (op_5 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 1 of 2
15. (op_5 obj_03 obj_10)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_10)
   goals met: 1 of 2
16. (op_3 obj_10 obj_15)
   deleted: (pred_2 obj_15 obj_10) (pred_1)
   added: (pred_9 obj_15)
   goals met: 1 of 2
17. (op_5 obj_10 obj_16)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_16)
   goals met: 1 of 2
18. (op_5 obj_16 obj_08)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_08)
   goals met: 1 of 2
19. (op_5 obj_08 obj_18)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_18)
   goals met: 1 of 2
20. (op_4 obj_18 obj_15)
   deleted: (pred_9 obj_15)
   added: (pred_1) (pred_2 obj_15 obj_18)
   goals met: 2 of 2
